In [1]:
import numpy   as np
import pandas  as pd
import pickle  as pkl
from sklearn.model_selection import train_test_split
from sklearn.ensemble        import RandomForestClassifier
from sklearn.preprocessing   import LabelEncoder
from sklearn.metrics         import precision_score,recall_score,accuracy_score

In [5]:
df = pd.read_csv("../DATA/TITANIC/train.csv")
dftest = pd.read_csv("../DATA/TITANIC/train.csv")

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
df = df[[ 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Embarked']]
dftest = dftest[[ 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Embarked']]

In [9]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [32]:
df.shape

(891, 8)

In [10]:
dftest.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [12]:
print(df.isnull().sum())

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [13]:
print(dftest.isnull().sum())

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [14]:
df = df.dropna()
dftest = dftest.dropna()

In [15]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [17]:
labelencoder = LabelEncoder()

In [18]:
df['Sex'] = labelencoder.fit_transform(df['Sex'])
dftest['Sex'] = labelencoder.fit_transform(dftest['Sex'])

In [19]:
df['Embarked'] = labelencoder.fit_transform(df['Embarked'])
dftest['Embarked'] = labelencoder.fit_transform(dftest['Embarked'])

In [30]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [24]:
dftest.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [26]:
X = df.drop("Survived",axis=1)
y = df['Survived']
X = np.array(X)
y = np.array(y)

In [37]:
XTEST = dftest.drop("Survived",axis=1)
YTEST = dftest['Survived']

In [33]:
XTEST.to_csv("CLEAN_FEATURE_TEST.csv")
YTEST.to_csv("CLEAN_TARGET_TEST.csv")

In [31]:
x_train,x_test,y_train,y_test = train_test_split(X,y)

In [38]:
model = RandomForestClassifier(max_depth=1000).fit(x_train,y_train)

In [39]:
y_pred = model.predict(x_test)

In [40]:
result_analysis = pd.DataFrame({'ytest':y_test,'ypred':y_pred})

In [52]:
result_analysis

     ytest  ypred
0        0      0
1        1      1
2        1      1
3        0      0
4        1      1
..     ...    ...
173      1      1
174      0      1
175      0      0
176      1      0
177      0      0

[178 rows x 2 columns]

In [42]:
def custom_metrics(y_test,y_pred):
    result = {}
    acc    = accuracy_score(y_test,y_pred)
    prec   = precision_score(y_test,y_pred)
    recall = recall_score(y_test,y_pred)
    result['acc'] = acc
    result['prec'] = prec
    result['recall'] = recall
    
    return result

In [43]:
custom_metrics(y_test,y_pred)

{'acc': 0.7752808988764045, 'prec': 0.7857142857142857, 'recall': 0.6875}

In [45]:
## serializer with pickle
pkl.dump(model,open("../MODEL/model1.pkl",'wb'))